name: "raw_audio_cnn_opt"
platform: "onnxruntime_onnx"
max_batch_size: 512

input [
  { name: "wav_input", data_type: TYPE_FP32, dims: [320000] }
]

output [
  { name: "raw_output", data_type: TYPE_FP32, dims: [206] }
]

dynamic_batching {
  preferred_batch_size: [128, 256, 512]
  max_queue_delay_microseconds: 50
}

instance_group [
  { count: 4, kind: KIND_GPU, gpus: [0] }
]
